micropython/micropython/ports/raspberrypi/boards/raspberry_pi_pico/mpconfigboard.h
// LEDs
// #define MICROPY_HW_LED_STATUS   (&pin_PA17)

#define MICROPY_HW_BOARD_NAME "Raspberry Pi Pico"
#define MICROPY_HW_MCU_NAME "rp2040"

// #define DEFAULT_I2C_BUS_SCL (&pin_PA23)
// #define DEFAULT_I2C_BUS_SDA (&pin_PA22)

// #define DEFAULT_SPI_BUS_SCK (&pin_PB11)
// #define DEFAULT_SPI_BUS_MOSI (&pin_PB10)
// #define DEFAULT_SPI_BUS_MISO (&pin_PA12)

// #define DEFAULT_UART_BUS_RX (&pin_PA11)
// #define DEFAULT_UART_BUS_TX (&pin_PA10)

// Flash chip is W25Q16JVUXIQ connected over QSPI
#define TOTAL_FLASH_SIZE 2 * 1024 * 1024
